# Pandas DataFrame

#let create a Dataframe of purchasing histrory from 6 stores using Series

In [44]:
purchase1={'Name':'Jhon','Good':'Pen','Cost': '1000RWF'}
purchase2={'Name':'Teddine','Good':'Laptop','Cost': '1000000RWF'}
purchase3={'Name':'January','Good':'Car','Cost': '10000000RWF'}
purchase4={'Name':'Gaspard','Good':'SmartPhone','Cost': '500000RWF'}
purchase5={'Name':'Jerome','Good':'Vehicle','Cost': '50000000RWF'}
purchase6={'Name':'Mary Grace','Good':'Car','Cost': '10000000RWF'}

In [45]:
import pandas as pd
df=pd.DataFrame([purchase1,purchase2,purchase3,purchase4,purchase5,purchase6],index=['Store 1','Store 2','Store 3','Store 4','Store 5','Store 6'])

In [47]:
print(df)

               Name        Good         Cost
Store 1        Jhon         Pen      1000RWF
Store 2     Teddine      Laptop   1000000RWF
Store 3     January         Car  10000000RWF
Store 4     Gaspard  SmartPhone    500000RWF
Store 5      Jerome     Vehicle  50000000RWF
Store 6  Mary Grace         Car  10000000RWF

In [48]:
df.head()

            Name        Good         Cost
Store 1     Jhon         Pen      1000RWF
Store 2  Teddine      Laptop   1000000RWF
Store 3  January         Car  10000000RWF
Store 4  Gaspard  SmartPhone    500000RWF
Store 5   Jerome     Vehicle  50000000RWF

In [51]:
df.head(5)

            Name        Good         Cost
Store 1     Jhon         Pen      1000RWF
Store 2  Teddine      Laptop   1000000RWF
Store 3  January         Car  10000000RWF
Store 4  Gaspard  SmartPhone    500000RWF
Store 5   Jerome     Vehicle  50000000RWF

In [53]:
df.tail(3)

               Name        Good         Cost
Store 4     Gaspard  SmartPhone    500000RWF
Store 5      Jerome     Vehicle  50000000RWF
Store 6  Mary Grace         Car  10000000RWF

In [54]:
df.tail(5)

               Name        Good         Cost
Store 2     Teddine      Laptop   1000000RWF
Store 3     January         Car  10000000RWF
Store 4     Gaspard  SmartPhone    500000RWF
Store 5      Jerome     Vehicle  50000000RWF
Store 6  Mary Grace         Car  10000000RWF

# Accessing content of store 1,2,3,4 with index (.loc)

In [56]:
df.loc['Store 1']

Name       Jhon
Good        Pen
Cost    1000RWF
Name: Store 1, dtype: object

In [57]:
df.loc['Store 2']

Name       Teddine
Good        Laptop
Cost    1000000RWF
Name: Store 2, dtype: object

In [58]:
df.loc['Store 4']

Name       Gaspard
Good    SmartPhone
Cost     500000RWF
Name: Store 4, dtype: object

In [59]:
#check type of DataFrame
print(type(df))

<class 'pandas.core.frame.DataFrame'>

# selecting the cost and index 'Store 2'

In [60]:
df.loc['Store 2']['Cost']

'1000000RWF'

# selecting one row and two columns by position(.iloc)

In [61]:
df.iloc[0,0:2]

Name    Jhon
Good     Pen
Name: Store 1, dtype: object

# selecting all rows row and their cost

In [64]:
df.iloc[:,2]

Store 1        1000RWF
Store 2     1000000RWF
Store 3    10000000RWF
Store 4      500000RWF
Store 5    50000000RWF
Store 6    10000000RWF
Name: Cost, dtype: object

# selecting all rows and  and two columns

In [66]:
   df.iloc[:,0:2]

               Name        Good
Store 1        Jhon         Pen
Store 2     Teddine      Laptop
Store 3     January         Car
Store 4     Gaspard  SmartPhone
Store 5      Jerome     Vehicle
Store 6  Mary Grace         Car

# Make transpose

In [67]:
df.T

      Store 1     Store 2      Store 3     Store 4      Store 5      Store 6
Name     Jhon     Teddine      January     Gaspard       Jerome   Mary Grace
Good      Pen      Laptop          Car  SmartPhone      Vehicle          Car
Cost  1000RWF  1000000RWF  10000000RWF   500000RWF  50000000RWF  10000000RWF

# selecting the cost at index 'Store 1'

In [70]:
df.loc['Store 5']['Cost']

'50000000RWF'

#deleting a row with 'Store 1' index

In [73]:
df.drop('Store 1')

               Name        Good         Cost
Store 2     Teddine      Laptop   1000000RWF
Store 3     January         Car  10000000RWF
Store 4     Gaspard  SmartPhone    500000RWF
Store 5      Jerome     Vehicle  50000000RWF
Store 6  Mary Grace         Car  10000000RWF

# deleting specific two columns
# deleting two columns temporary

In [74]:
 df.drop(columns=['Name','Cost'])

               Good
Store 1         Pen
Store 2      Laptop
Store 3         Car
Store 4  SmartPhone
Store 5     Vehicle
Store 6         Car

In [75]:
df.head()

            Name        Good         Cost
Store 1     Jhon         Pen      1000RWF
Store 2  Teddine      Laptop   1000000RWF
Store 3  January         Car  10000000RWF
Store 4  Gaspard  SmartPhone    500000RWF
Store 5   Jerome     Vehicle  50000000RWF

# deleting permanently a column named 'Name'

In [76]:
del df['Cost']

In [77]:
df.head()

            Name        Good
Store 1     Jhon         Pen
Store 2  Teddine      Laptop
Store 3  January         Car
Store 4  Gaspard  SmartPhone
Store 5   Jerome     Vehicle

#adding column named 'Location'

In [80]:
df['Location']=None

In [81]:
df.head()

            Name        Good Location
Store 1     Jhon         Pen     None
Store 2  Teddine      Laptop     None
Store 3  January         Car     None
Store 4  Gaspard  SmartPhone     None
Store 5   Jerome     Vehicle     None

In [82]:
df['Type']='Second Hand'

In [83]:
df

               Name        Good Location         Type
Store 1        Jhon         Pen     None  Second Hand
Store 2     Teddine      Laptop     None  Second Hand
Store 3     January         Car     None  Second Hand
Store 4     Gaspard  SmartPhone     None  Second Hand
Store 5      Jerome     Vehicle     None  Second Hand
Store 6  Mary Grace         Car     None  Second Hand

# Indexing Dataframes

# display first 5 rows of the dataFrame with head

In [86]:
df.head()

            Name        Good Location         Type
Store 1     Jhon         Pen     None  Second Hand
Store 2  Teddine      Laptop     None  Second Hand
Store 3  January         Car     None  Second Hand
Store 4  Gaspard  SmartPhone     None  Second Hand
Store 5   Jerome     Vehicle     None  Second Hand

Reset the index of DataFrame with reset_index function

In [87]:
df=df.reset_index()

In [88]:
df.head()

     index     Name        Good Location         Type
0  Store 1     Jhon         Pen     None  Second Hand
1  Store 2  Teddine      Laptop     None  Second Hand
2  Store 3  January         Car     None  Second Hand
3  Store 4  Gaspard  SmartPhone     None  Second Hand
4  Store 5   Jerome     Vehicle     None  Second Hand

display the names of the columns of the DataFrame

In [89]:
print(df.columns)

Index(['index', 'Name', 'Good', 'Location', 'Type'], dtype='object')

Set the column as the inex with set_index

In [90]:
df=df.set_index('Name')

In [91]:
df.head()

           index        Good Location         Type
Name
Jhon     Store 1         Pen     None  Second Hand
Teddine  Store 2      Laptop     None  Second Hand
January  Store 3         Car     None  Second Hand
Gaspard  Store 4  SmartPhone     None  Second Hand
Jerome   Store 5     Vehicle     None  Second Hand

Save the DataFrame into a CSV file called "Table"

In [94]:
df.to_csv('Table.csv')

Import data from a CSV file from our computer local drive

In [97]:
data=pd.read_csv("Table.csv",index_col=0)

In [98]:
data.head()

           index        Good  Location         Type
Name
Jhon     Store 1         Pen       NaN  Second Hand
Teddine  Store 2      Laptop       NaN  Second Hand
January  Store 3         Car       NaN  Second Hand
Gaspard  Store 4  SmartPhone       NaN  Second Hand
Jerome   Store 5     Vehicle       NaN  Second Hand

# Thank You!!!